{"posts":[{"woa_time":"2025:03:24:14:28:49","title":"It's not always about the little black dots","content":["Athough we love them, the little balck dots of \"standard\" notation can be a barrier to sharing information or tips about music composition. Even you can read it already - you have a lot of information automatically bundled in, but knowing how to read standard notation shouldn't be a prerequisite to learning how to write sounds.  Especially since the most common instrument nowdays is the Midi piano roll.","The midi piano roll is a grid system - x-axis is time divided into the subdivisions and the y-axis is the pitch space in semitones.  This is very intuitive and is closer to a moree scientific view of music.  It also can be a bridge between tab and standard notatation.","Going forward, I'm going to try using these \"music-grid\" images to explain musical concepts and composition tips."]},{"woa_time":"2025:01:16:10:26:08","title":"Necessary Shape-Shifting","content":["So, due to some numbness in my left hand, which is likely from my guitars and basses adding strain to my neck and shoulders, I'm going to pivot to using the more \"Ergonomic\" Instruments like Drums, Keys, and Voice.","This will have a period of frustration as I am not as fluid on keys and drums as I am on guitar or bass - but I gotta do what I gotta do.  Hopefully it will open up a different world of sounds for me."]},{"woa_time":"2024:11:21:15:10:36","title":"Getting Back to LilyPond","content":["I've decided to get back into working with LilyPond","LilyPond is a music engraving program that compiles text based files into notation and midi. It's heavily inspired by and built on LaTeX. It is very progammery but it has the power to have human readable code and work with version control","I'm looking forward to getting better at using all my musical tools."]},{"woa_time":"2024:11:20:16:19:35","title":"Melodies to Chords vs. Counterpoint","content":["Here's the hot take and TL;DR - they are the same thing.","The bottom voice of your chord progression is your Cantus Firmus and the other notes of the chords are the \"pre-installed\" other voices already set as one to one counterpoint against The Cantus Firmus. Writing a melody to the chord progression is just adding a new line in florid counterpoint.","Bottom line: Chord Theory is kind of a short-hand or hack for counterpoint.","What are your thoughts?"]},{"woa_time":"2024:11:20:12:21:49","title":"One thing about me","content":["I am a bit of a Nerd but an artistically motivated one.","I used to be horrible at mathematics until I figured out how it related to drawing and codes - I was obessed with secret codes. After I found that relationship between math and art - I was hooked - and I ended up getting my Bachelors in Mathematics.","Same with programming - I get obsessed with writing programs if it can make my life easier in art and music - hence my programming to help with this blog."]},{"woa_time":"2024:11:20:12:21:32","title":"First Blog Entry From File","content":["So here I am trying to add support for writing blog entries as simple text files. The idea here is that this will allow to also write in ways where I can correct my spelling and other errors before submitting. Have a function for adding a Post inline <em>AND</em> via a file allows for greator flexibility.","I may use this approach for creating Wizard Of Aarc's Grimoire. My collection of tips, reflections, and epiphanies for all things music and music related. Whether or not the blog becomes the Grimoire is another question altogether.","How does this look?"]}]}